
<!-- pr-auto-comment-tf/core -->
### ToFu - core
| Step | Outcome |
| ---- | ------- |
| :pencil2: **Format** | `success` |
| :wrench: **Init** ️| `success` |
| :mag: **Validate** | `success` |
| :page_facing_up: **Plan** | `success` |
| :passport_control: **Verify** | `success` |
| :point_right: **Result** | change(s): 4 to add, 0 to change, 0 to destroy. |

<details><summary>show change(s)</summary>

```
OpenTofu will perform the following actions:

  # hetznerdns_record.of-tl-org["helium.ns.hetzner.de."] will be created
  + resource "hetznerdns_record" "of-tl-org" {
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 3600
      + type    = "NS"
      + value   = "helium.ns.hetzner.de."
      + zone_id = (known after apply)
    }

  # hetznerdns_record.of-tl-org["hydrogen.ns.hetzner.com."] will be created
  + resource "hetznerdns_record" "of-tl-org" {
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 3600
      + type    = "NS"
      + value   = "hydrogen.ns.hetzner.com."
      + zone_id = (known after apply)
    }

  # hetznerdns_record.of-tl-org["oxygen.ns.hetzner.com."] will be created
  + resource "hetznerdns_record" "of-tl-org" {
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 3600
      + type    = "NS"
      + value   = "oxygen.ns.hetzner.com."
      + zone_id = (known after apply)
    }

  # hetznerdns_zone.of-tl-org will be created
  + resource "hetznerdns_zone" "of-tl-org" {
      + id   = (known after apply)
      + name = "of.tahoe-lafs.org"
      + ns   = (known after apply)
      + ttl  = 3600
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

<details><summary>show error(s)</summary>

```

```

</details>

*Pusher: @btlogy, Action: `pull_request`*
*Workflow: `tahoe-lafs/infrastructure/.github/workflows/tf-core.yml@refs/pull/57/merge`*